allergen-lab/app/views/foods/_form.html.erb

<%=f.label :recipe%><br/>
<%=f.collection_select :recipe_id, Recipe.all, :id, :name%><br/><br/>
<%=f.label :ingredient%><br/>
<%=f.collection_select :ingredient_id, Ingredient.all, :id, :name%><br/><br/>
---
SELECT "recipes".* FROM "recipes"
SELECT "ingredients".* FROM "ingredients"