allergen-lab/app/views/recipes/_form.html.erb

SELECT "users".* FROM "users"
---
<%=f.label "Author"%><br/>
<%=f.collection_select :user_id, User.all, :id, :name%><br/><br/>