allergen-lab/app/views/recipes/show.html.erb

<ul>
<%@recipe.foods.each do |f|%>
---
SELECT "foods".* FROM "foods" WHERE "foods"."recipe_id" = ?  [["recipe_id", 2]]