allergen-lab/app/views/users/show.html.erb

    <ol>
        <%@user.recipes.each do |r|%>
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = ?  [["user_id", 1]]

    <ul>
        <% @user.allergies.each do |a|%>
---
SELECT "allergies".* FROM "allergies" WHERE "allergies"."user_id" = ?  [["user_id", 1]]