allergen-lab/app/controllers/allergies_controller.rb

INSERT INTO "allergies" ("ingredient_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["ingredient_id", 13], ["user_id", 1], ["created_at", "2020-11-04 00:38:16.801377"], ["updated_at", "2020-11-04 00:38:16.801377"]]
---
    def create
        @allergy = Allergy.new(params.require(:allergy).permit(:user_id, :ingredient_id))
        if @allergy.save

SELECT "allergies".* FROM "allergies" WHERE "allergies"."id" = ? LIMIT ?  [["id", 47], ["LIMIT", 1]]
DELETE FROM "allergies" WHERE "allergies"."id" = ?  [["id", 47]]
---
    def destroy
        @allergy = Allergy.find(params[:id])
        @allergy.destroy