allergen-lab/app/controllers/foods_controller.rb

INSERT INTO "foods" ("ingredient_id", "recipe_id", "measurement", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["ingredient_id", 4], ["recipe_id", 4], ["measurement", "5 cups"], ["created_at", "2020-11-03 22:51:35.319915"], ["updated_at", "2020-11-03 22:51:35.319915"]]
---
    def create
        @food = Food.new(food_params)
        if @food.save