allergen-lab/app/controllers/ingredients_controller.rb

SELECT COUNT(*) FROM "users" INNER JOIN "allergies" ON "users"."id" = "allergies"."user_id" WHERE "allergies"."ingredient_id" = ?  [["ingredient_id", 5]]
SELECT "ingredients".* FROM "ingredients"
SELECT "users".* FROM "users" INNER JOIN "allergies" ON "users"."id" = "allergies"."user_id" WHERE "allergies"."ingredient_id" = ?  [["ingredient_id", 1]]
---
   def index
    @ingredients = Ingredient.all.sort_by {|i| i.users.length}.reverse

INSERT INTO "ingredients" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Coffee"], ["created_at", "2020-11-04 00:10:56.930577"], ["updated_at", "2020-11-04 00:10:56.930577"]]
---
   def create
    @ingredient = Ingredient.new(params.require(:ingredient).permit(:name))
        if @ingredient.valid?
            @ingredient.save