allergen-lab/app/controllers/recipes_controller.rb

SELECT "ingredients".* FROM "ingredients" INNER JOIN "foods" ON "ingredients"."id" = "foods"."ingredient_id" WHERE "foods"."recipe_id" = ?  [["recipe_id", 2]]
SELECT "recipes".* FROM "recipes"
---
    def index
        if params[:sort]
            @recipes = Recipe.all.sort_by{|recipe|recipe.ingredients.length}

INSERT INTO "recipes" ("name", "meal_type", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Recipe Test"], ["meal_type", "Lunch"], ["user_id", 1], ["created_at", "2020-11-04 01:52:22.858293"], ["updated_at", "2020-11-04 01:52:22.858293"]]
---
    def create
        @recipe = Recipe.new(recipe_params)
        if @recipe.valid?
            @recipe.save

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def get_recipe
        @recipe = Recipe.find(params[:id])