allergen-lab/app/views/ingredients/index.html.erb


has <%= i.users.count%> people with allergies</li>
---
SELECT "users".* FROM "users" INNER JOIN "allergies" ON "users"."id" = "allergies"."user_id" WHERE "allergies"."ingredient_id" = ?  [["ingredient_id", 1]]
SELECT COUNT(*) FROM "users" INNER JOIN "allergies" ON "users"."id" = "allergies"."user_id" WHERE "allergies"."ingredient_id" = ?  [["ingredient_id", 5]]