allergen-lab/app/views/ingredients/show.html.erb

<h3>Recipes</h3>
<% @ingredient.recipes.each do |r|%>
---
SELECT "recipes".* FROM "recipes" INNER JOIN "foods" ON "recipes"."id" = "foods"."recipe_id" WHERE "foods"."ingredient_id" = ?  [["ingredient_id", 5]]